{"language": "en", "help_text": {"en": "Welcome and thank you for using our software for Smart Presence. In this application, you are able to download from Firebase database or load from locally the occupancy profile, generate pseudo occupancy profile based on certain scenarios, visulaize the profiles in graphs for different time resolution and perform actions related to simulation including generating schedules, modify idf file and so on. Note that there are four json files named 'config.json', 'myFirestoreKey.json', 'standard_weekdays.json' and 'standard_weekends.json' that are mandatory for the software to run.\n\nIn the option menu, beside the function of changing the language, you can also require the 'access code' for accessing the information of all target buildings in the mobile application by inputting the email you use to login.\n\nBuilding Occupancy Profile: The first section on the left is for accessing all kinds of occupancy profiles. You can either download occupancy profile for certain target building by selecting its address or load a sepcific json file in which the occupancy profiles are already formatted in a certain way.\n\nPesudo Data Generation: You can also try to generate some fake data based on standard for occupancy profile that will be configured in the exact same way in the second section on the left. You need firstly specify certain scenario which will affect the outputs in certain way, like afftecting the noise level or referring to vacation condition. Furthermore, for scenario 6 you can also specify the variance noise. Secondly, you need to select the period by choosing the start date and stop date, and finally click on the button to generate fake data.\n\nActions: There are two types of actions in the third section on the left. First of all, you can visualize your selected occupancy profile in different level of time resolution with or without comparing with standard. The plots will be either generated on the right side or poped out in another window. Secondly, you can download the selected occupancy profile in a specific json format for further usage.\n\nSimulation: First of all, for the generation of schedule based on your occupancy, you need to first choose the target duration and then click the target button, and all the periods that have not been selected in a year will be configured by the default option specified in 'Option for other date'. At last you need to click on 'Generate Schedule' to finish the procedure. Then you need to load idf and epw files. You will need to modify the idf file with schedule based on selected occupancy by clicking 'Modify Occupancy' and then click on 'Start Simulation' to perform the simulation. Note that defaultly, simulation with standard occupancy will be performed as well, but you can disable it by uncheck the 'With standard' box.\n\nIndicator: All kinds of actions upon clicking a button will result in a message in indicator to notify the results and possible errors. The selected durations for generating schedule will also be recorded and displayed here.\n\nFor further information, please refer to tailai.song@studenti.polito.it. Thanks.", "it": "Benvenuto e grazie per aver utilizzato il nostro software per Smart Presence. In questa applicazione è possibile scaricare dal database Firebase o caricare localmente il profilo di occupazione, generare pseudo profilo di occupazione basato su determinati scenari, visualizzare i profili nei grafici per diverse risoluzioni temporali ed eseguire azioni relative alla simulazione inclusa la generazione di programmi, modificare idf file e così via. Nota che ci sono quattro file json chiamati 'config.json', 'myFirestoreKey.json', 'standard_weekdays.json' e 'standard_weekends.json' che sono obbligatori per l'esecuzione del software.\n\nNel menu delle opzioni, accanto a funzione di modifica della lingua, puoi anche richiedere il 'codice di accesso' per accedere alle informazioni di tutti gli edifici target nell'applicazione mobile inserendo l'e-mail che usi per accedere.\n\nProfilo di occupazione dell'edificio: la prima sezione a sinistra è per accedere a tutti i tipi di profili di occupazione. Puoi scaricare il profilo di occupazione per un determinato edificio di destinazione selezionando il suo indirizzo o caricare un file json specifico in cui i profili di occupazione sono già formattati in un certo modo.\n\nPesudo Data Generation: puoi anche provare a generare alcuni dati falsi basati su standard per profilo di occupazione che verrà configurato esattamente allo stesso modo nella seconda sezione a sinistra. È necessario in primo luogo specificare uno scenario che influenzerà le uscite in un certo modo, come influenzare il livello di rumore o fare riferimento alle condizioni di vacanza. Inoltre, per lo scenario 6 è anche possibile specificare il rumore di varianza. In secondo luogo, devi selezionare il periodo scegliendo la data di inizio e la data di fine, e infine fare clic sul pulsante per generare dati falsi.\n\nAzioni: nella terza sezione a sinistra sono presenti due tipi di azioni. Innanzitutto, puoi visualizzare il tuo profilo di occupazione selezionato in diversi livelli di risoluzione temporale con o senza confronto con lo standard. I grafici verranno generati sul lato destro o visualizzati in un'altra finestra. In secondo luogo, puoi scaricare il profilo di occupazione selezionato in un formato json specifico per un ulteriore utilizzo.\n\nSimulazione: Per la generazione del programma in base alla tua occupazione, devi prima scegliere la durata target e quindi fare clic sul pulsante target, e tutti i periodi che non sono stati selezionati in un anno verranno configurati dall'opzione predefinita specificata in 'Opzione per altri Data'. Infine è necessario fare clic su 'Genera pianificazione' per completare la procedura. Quindi è necessario caricare i file idf ed epw. Sarà necessario modificare il file idf con la pianificazione in base all'occupazione selezionata facendo clic su 'Modifica occupazione' e quindi su 'Avvia simulazione' per eseguire la simulazione. Nota che per impostazione predefinita verrà eseguita anche la simulazione con occupazione standard, ma puoi disabilitarla deselezionando la casella 'Con standard'.\n\nIndicatore: tutti i tipi di azioni dopo aver fatto clic su un pulsante risulteranno in un messaggio nell'indicatore per notificare i risultati e possibili errori. Anche le durate selezionate per la generazione del palinsesto verranno registrate e visualizzate qui.\n\nPer ulteriori informazioni, fare riferimento a tailai.song@studenti.polito.it. Grazie.", "ch": "欢迎并感谢您使用我们的 Smart Presence 软件。在这个应用程序中，您可以从 Firebase 数据库下载或从本地加载占用配置文件，根据特定场景生成伪占用配置文件，在图表中可视化不同时间分辨率的配置文件，并执行与模拟相关的操作，包括生成时间表、修改 idf文件等。请注意，有四个名为“config.json”、“myFirestoreKey.json”、“standard_weekdays.json”和“standard_weekends.json”的 json 文件是软件运行所必需的。\n\n在选项菜单中，旁边的更改语言功能，您也可以通过输入您登录时使用的电子邮件在移动应用程序中获取访问所有目标建筑物信息的“访问代码”。\n\n建筑物占用情况：左侧第一部分是用于访问各种占用配置文件。您可以通过选择地址下载特定目标建筑物的占用配置文件，也可以加载一个特定的 json 文件，其中占用配置文件已经以某种方式格式化。\n\nPesudo 数据生成：您也可以尝试生成一些基于虚假数据的数据占用配置文件的标准，将在左侧第二部分中以完全相同的方式进行配置。您需要首先指定将以某种方式影响输出的特定场景，例如影响噪音水平或参考假期条件。此外，对于场景 6，您还可以指定方差噪声。其次，您需要通过选择开始日期和停止日期来选择周期，最后点击按钮生成假数据。\n\n动作：左侧第三部分有两种动作。首先，您可以在不同级别的时间分辨率下可视化您选择的占用配置文件，无论是否与标准进行比较。绘图将在右侧生成或在另一个窗口中弹出。其次，您可以以特定的 json 格式下载选定的占用配置文件以供进一步使用。\n\n模拟：。根据您的入住情况生成时间表，您需要先选择目标持续时间，然后单击目标按钮，一年中所有未选择的期间将由“其他选项”中指定的默认选项配置日期'。最后，您需要单击“生成计划”以完成该过程。\n\n指示器：单击按钮后的各种操作都会在指示器中产生一条消息，以通知结果和可能的错误。生成时间表的选定持续时间也会在此处记录和显示。\n\n更多信息，请参阅tailai.song@studenti.polito.it。谢谢。"}}